---
title: "Hospital Network Design & Implementation Using Cisco Packet Tracer"
collection: talks
type: "Projet"
permalink: /talks/reseau-gestion-hotel
date: 2025-08-15
location: "Fès, Maroc"
excerpt: "Projet de réseau de gestion hôtelière avec Packet Tracer. Description courte visible dans la liste."
---

## Introduction au Projet
Ce projet consiste à concevoir, configurer et sécuriser l'infrastructure réseau complète d'un hôpital de trois étages à l'aide de Cisco Packet Tracer. L'objectif principal est de créer un réseau robuste, segmenté et sécurisé, où chaque service hospitalier dispose de son propre réseau logique (VLAN) pour garantir la confidentialité des données et optimiser les performances.
La topologie s'articule autour de trois routeurs (un par étage) et de plusieurs switchs, assurant une communication inter-VLAN efficace et une connectivité externe sécurisée grâce au protocole de routage OSPF et à l'accès à distance via SSH.
<figure style="text-align: center;">
  <img src="/files/hospital_network_topology.png" alt="Topologie du réseau hospitalier" style="max-width: 100%; height: auto;">
  <figcaption>Topologie du réseau hospitalier conçu avec Packet Tracer</figcaption>
</figure>



## Plan du Projet
### Étape 1 : Conception Logique du Réseau : Segmentation par VLANs
### Étape 2 : Création des Vlans  
### Étape 3 : Routage Inter-VLAN : La Technique "Router-on-a-Stick"
### Étape 4 : Attribution Automatique d'Adresses IP : Service DHCP
### Étape 5 : Routage Dynamique avec OSPF
### Étape 6 :	Sécurité : Configuration SSH des routeurs 

## Réalisation du Projet
### Étape 1 : Conception Logique du Réseau : Segmentation par VLANs
La première étape consiste à segmenter le réseau en fonction des différents services de l'hôpital pour isoler les flux de données et renforcer la sécurité. Chaque étage est équipé d'un routeur et d'un ou plusieurs switchs pour gérer ses propres VLANs.
Voici la répartition des VLANs par étage et par service :

| Étage       | ID VLAN | Nom du Service         | Sous-réseau IP     |
|-------------|---------|------------------------|--------------------|
| 1er étage   | VLAN 60 | Infirmerie            | 192.168.6.0/24     |
| 1er étage   | VLAN 70 | Urgences              | 192.168.7.0/24     |
| 1er étage   | VLAN 80 | Accueil               | 192.168.8.0/24     |
| 2ème étage  | VLAN 30 | Laboratoire           | 192.168.3.0/24     |
| 2ème étage  | VLAN 40 | Médecine              | 192.168.4.0/24     |
| 2ème étage  | VLAN 50 | Pharmacie             | 192.168.5.0/24     |
| 3ème étage  | VLAN 10 | Administration        | 192.168.1.0/24     |
| 3ème étage  | VLAN 20 | IT (Informatique)     | 192.168.2.0/24     |

### Étape 2 : Création des VLANs

#### **Configuration du Switch pour le 1er Étage**
Les VLANs sont créés et configurés sur les switch pour segmenter les services hospitaliers. Les ports sont assignés en mode accès pour les appareils finaux et en mode trunk pour la connexion au routeur.
```bash
Switch#enable
Switch#configure
Switch(config)#int range fa0/2-3
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan 80
% Access VLAN does not exist. Creating vlan 80
Switch(config-if-range)#int range fa0/4-5
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan 70
% Access VLAN does not exist. Creating vlan 70
Switch(config-if-range)#int range fa0/6-7
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan 60
% Access VLAN does not exist. Creating vlan 60
Switch(config-if-range)#do wr
```
#### **Pour renommer les VLANs**
```bash
vlan 80
name  Accueil
exit
vlan 70
name Urgence
exit
vlan 60
name  Infirmerie 
exit
```
#### **Ports d’Accès et Trunks**

Sur chaque switch, les ports sont configurés selon **deux modes principaux** :  

- **Mode Accès (Access Mode)** :  
  Les ports connectés directement aux appareils finaux (PC, imprimantes, etc.) sont configurés en mode accès. Chaque port en mode accès appartient à un seul VLAN, ce qui permet de segmenter le réseau et d’isoler le trafic des différents services.  

- **Mode Trunk (Trunk Mode)** :  
  Les ports qui relient les switchs aux routeurs ou à d’autres switchs sont configurés en mode trunk. Un port trunk peut transporter le trafic de **plusieurs VLANs simultanément** grâce à l’étiquetage 802.1Q. Cela permet au routeur ou aux switchs de distinguer à quel VLAN appartient chaque trame et de gérer correctement la communication entre les VLANs.


```bash
Switch(config)#int range fa0/1
Switch(config-if-range)#switchport mode trunk
Switch(config-if-range)#do wr
```
**Note** : Mêmes configurations pour les autres switches
<figure style="text-align: center;">
  <img src="/files/switch_trunk_config.png" alt="Configuration du port trunk sur le switch" style="max-width: 100%; height: auto;">
  <figcaption>Interface du switch configurée en mode trunk dans Packet Tracer</figcaption>
</figure>
### Étape 3 : Routage Inter-VLAN — La Technique "Router-on-a-Stick"

Pour que les appareils de différents VLANs puissent communiquer entre eux (par exemple, un médecin du VLAN 40 doit pouvoir accéder à une information du laboratoire dans le VLAN 30), un routage est nécessaire.  

La technique **"Router-on-a-Stick"** a été implémentée sur chaque routeur d'étage. Elle consiste à :  

1. Créer des sous-interfaces virtuelles sur l'interface physique du routeur connectée au switch (ex: `GigabitEthernet0/0`).  
2. Assigner chaque sous-interface à un VLAN spécifique (ex: `GigabitEthernet0/0.10` pour le VLAN 10).  
3. Configurer l'encapsulation `dot1Q` sur chaque sous-interface pour qu'elle reconnaisse les trames étiquetées du VLAN correspondant.  
4. Attribuer une adresse IP à chaque sous-interface, qui servira de passerelle par défaut pour tous les appareils de ce VLAN.  

**Exemple pour le Routeur R1 :**

```bash
Router(config)#interface serial0/2/0
Router(config-if)#ip address 10.10.10.5 255.255.255.252

Router(config)#interface serial0/2/1
Router(config-if)#ip address 10.10.10.9 255.255.255.252

Router(config)#interface GigabitEthernet0/0.80
Router(config-subif)#encapsulation dot1Q 80
Router(config-subif)#ip address 192.168.8.1 255.255.255.0
Router(config-subif)#exit

Router(config)#interface GigabitEthernet0/0.70
Router(config-subif)#encapsulation dot1Q 70
Router(config-subif)#ip address 192.168.7.1 255.255.255.0
Router(config-subif)#exit

Router(config)#interface GigabitEthernet0/0.60
Router(config-subif)#encapsulation dot1Q 60
Router(config-subif)#ip address 192.168.6.1 255.255.255.0
Router(config-subif)#do wr
```
### Étape 4 : Attribution Automatique d'Adresses IP : Service DHCP
Pour simplifier la gestion des adresses IP, chaque routeur a été configuré comme **serveur DHCP**. Des pools DHCP distincts ont été créés pour chaque VLAN.  

Chaque pool DHCP fournit automatiquement aux appareils connectés :  
- Une **adresse IP** dans le bon sous-réseau.  
- Le **masque de sous-réseau**.  
- L'adresse de la **passerelle par défaut** (l'IP de la sous-interface du routeur).  
- L'adresse du **serveur DNS**.  

**Exemple de configuration sur un routeur R1 :**

```bash
Router> enable
Router# config
Router(config)# service dhcp

# Pool DHCP pour le VLAN Accueil
Router(config)# ip dhcp pool Accueil
Router(dhcp-config)# network 192.168.8.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.8.1
Router(dhcp-config)# dns-server 192.168.8.1
Router(dhcp-config)# exit

# Pool DHCP pour le VLAN Urgence
Router(config)# ip dhcp pool Urgence
Router(dhcp-config)# network 192.168.7.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.7.1
Router(dhcp-config)# dns-server 192.168.7.1
Router(dhcp-config)# exit

# Pool DHCP pour le VLAN Infirmerie
Router(config)# ip dhcp pool Infirmerie
Router(dhcp-config)# network 192.168.6.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.6.1
Router(dhcp-config)# dns-server 192.168.6.1
Router(dhcp-config)# exit
```



    
